app/Controllers/Dashboard/Admin.php

    public function index()
    {
        $total_event = $this->event_model->dashboard_total_event_admin()->getResultArray();
        $total_event = (count($total_event) > 0) ? $total_event[0]['total'] : 0;

        $total_tiket = $this->pembelian_detail_model->dashboard_total_tiket_admin()->getResultArray();
        $total_tiket = intval($total_tiket[0]['total']);

        $total_pembelian = $this->pembelian_detail_model->dashboard_total_pembelian_admin()->getResultArray();
        $total_pembelian = number_format($total_pembelian[0]['total']);

        $total_pengguna = $this->user_model->dashboard_total_pengguna_admin()->getResultArray();
---
SELECT *
FROM `tb_event`
SELECT *
FROM `tb_user`