app/Controllers/Auth.php

UPDATE `tb_user` SET `key_forgot` = '050848711904b62fb07133fd34c68948b7b1c69c'
WHERE `tb_user`.`user_id` IN ('3')
---
    public function forgot_password_post()
    {
        if (! $this->validate([
            'email'  => [
            	'label'  => 'Email',
        		'rules'  => 'required|valid_email|min_length[3]',
            ]
        ])) {
            // The validation fails, so returns the form.
            $this->session->setFlashdata('error', '<strong>Error!</strong>');
            return $this->forgot_password();
        }

        $post = $this->validator->getValidated();

        $check = $this->user_model->find_by_email($post['email']);
        // var_dump($check['user_id']);die;

        if(!empty($check))
        {
        	$key_forgot = sha1($check['user_id'].time());

        	$this->user_model->update($check['user_id'], [
        		'key_forgot' => $key_forgot
        	]);

UPDATE `tb_user` SET `password` = 'ac554b9c4f60a8d81b6edec2e9cda9fbc7e5bb5f', `key_forgot` = NULL
WHERE `tb_user`.`user_id` IN ('3')
---
    public function forgot_password_form_post($key)
    {
    	if (! $this->validate([
            'email'  => [
            	'label'  => 'Email',
        		'rules'  => 'required|valid_email|min_length[3]',
            ],
            'password'  => [
            	'label'  => 'Password',
        		'rules'  => 'required|min_length[3]',
            ]
        ])) {
            // The validation fails, so returns the form.
            $this->session->setFlashdata('error', '<strong>Error!</strong>');
            return $this->forgot_password_form();
        }

        $post = $this->validator->getValidated();

    	$user = $this->user_model->find_by_email($post['email']);

    	$this->user_model->update($user['user_id'], [
    		'password' => sha1($post['password']),
    		'key_forgot' => null
    	]);