app/Models/EventModel.php

    public function list_published_by_time()
    {

        return $this->where('status', 'publish')->where('waktu > ', date('Y-m-d H:i:s'))->orderBy('waktu', 'ASC')->get();
---
SELECT *
FROM `tb_event`
WHERE `status` = 'publish'
AND `waktu` > '2024-04-16 14:30:20'
ORDER BY `waktu` ASC