app/Models/UserModel.php

    public function login($email, $password)
    {

        return $this->where('email', strtolower($email))
        ->where('password', sha1($password))
        ->first();
---
SELECT *
FROM `tb_user`
WHERE `email` = 'dian@mail.com'
AND `password` = 'ac554b9c4f60a8d81b6edec2e9cda9fbc7e5bb5f'
 LIMIT 1