app/Models/UserModel.php

    public function login($email, $password)
    {

        return $this->where('email', strtolower($email))
        ->where('password', sha1($password))
        ->where('status', 'active')
        ->first();
---
SELECT *
FROM `tb_user`
WHERE `email` = 'admin@mail.com'
AND `password` = 'd033e22ae348aeb5660fc2140aec35850c4da997'
AND `status` = 'active'
 LIMIT 1

    public function find_by_email($email)
    {
        return $this->where('email', strtolower($email))
        ->first();
---
SELECT *
FROM `tb_user`
WHERE `email` = 'dian@mail.com'
 LIMIT 1

    public function find_by_key($key)
    {
        return $this->where('key_forgot', $key)
        ->first();
---
SELECT *
FROM `tb_user`
WHERE `key_forgot` = '050848711904b62fb07133fd34c68948b7b1c69c'
 LIMIT 1